print('辰宇同学，你真的懂我吗？o(￣ヘ￣o＃)')
score = 0
i = 0
while i < 1 :
    print('***********************************************')
    a1 = input('1.我出门前总要磨蹭很久吗？\n a.是的\n b.有时会\n c.从不\n')
    if a1 == 'b':
        score += 10
    elif a1 == 'a' or a1== 'c':
        score +=0
    else:
        print('大笨蛋，输入错误，请重新来o(▼皿▼メ;)o')
        break
    print('***********************************************')
    a2 = input('2.我是很喜欢养宠物的人吗？\n a.是的，养过宠物\n b.喜欢，但是没养过\n c.完全不喜欢\n')
    if a2 == 'a':
        score += 10
    elif a2 == 'b' or a2=='c':
        score += 0
    else:
        print('大笨蛋，输入错误，请重新来o(▼皿▼メ;)o')
        break
    print('***********************************************')
    a3 = input('3.放假时我一般几点起床？\n a.6点前\n b.6点到9点\n c.9点以后\n')
    if a3 == 'b':
        score += 10
    elif a3 == 'a' or a3== 'c':
        score += 0
    else:
        print('大笨蛋，输入错误，请重新来o(▼皿▼メ;)o')
        break
    print('***********************************************')
    a4 = input('4.我平常喜欢喷香水吗？\n a.喜欢的\n b.不喜欢')
    if a4 == 'b':
        score += 10
    elif a4 == 'a' :
        score += 0
    else:
        print('大笨蛋，输入错误，请重新来o(▼皿▼メ;)o')
        break
    print('***********************************************')
    a5 = input('5.我喜欢的音乐或旋律是什么样的？\n a.流畅柔和的轻音乐\n b.流行好听的音乐\n c.激烈、节奏感强的音乐\n')
    if a5 == 'b':
        score += 10
    elif a5 == 'a' or a5=='c':
        score += 0
    else:
        print('大笨蛋，输入错误，请重新来o(▼皿▼メ;)o')
        break
    print('***********************************************')
    a6 = input('6.睡觉之前我喜欢？\n a.看电视\n b.看书\n c.玩手机\n')
    if a6 == 'c':
        score += 10
    elif a6 == 'a' or a6=='b':
        score += 0
    else:
        print('大笨蛋，输入错误，请重新来o(▼皿▼メ;)o')
        break
    print('***********************************************')
    a7 = input('7.我认为到海边最好的事情是？\n a.冲浪或者潜水\n b.吃海鲜\n c.看海景\n d.看日出')
    if a7 == 'b':
        score += 10
    elif a7 == 'a' or a7=='c'or a7=='d':
        score += 0
    else:
        print('大笨蛋，输入错误，请重新来o(▼皿▼メ;)o')
        break
    print('***********************************************')
    a8 = input('8.吃饭时我喜欢哪种饮料？\n a.白开水\n b.果汁\n c.酒类')
    if a8 == 'b':
        score += 10
    elif a8 == 'a' or a8=='c':
        score += 0
    else:
        print('大笨蛋，输入错误，请重新来o(▼皿▼メ;)o')
        break
    print('***********************************************')
    a9 = input('9.我更喜欢去热一点的地方旅游还是冷一点的地方？\n a.冷一点的\n b.热一点的\n c.都可以')
    if a9 == 'a':
        score += 10
    elif a9 == 'b' or a9=='c':
        score += 0
    else:
        print('大笨蛋，输入错误，请重新来o(▼皿▼メ;)o')
        break
    print('***********************************************')
    a10 = input('10.我最喜欢的季节是？\n a.春天\n b.夏天\n c.秋天\n d.冬天')
    if a10 == 'c':
        score += 10
    elif a10 == 'a' or a10=='b' or a10=='d':
        score += 0
    else:
        print('大笨蛋，输入错误，请重新来o(▼皿▼メ;)o')
        break
    i+=1
    print('十道题你做对了%d道'%(score/10))
if score <30:
    print('原来你不爱我 😭')
if 30<=score<70:
    print('看来你对我还是不太了解 o(≧口≦)o')
if 70<= score <90:
    print('看来我们还是很默契的嘛o(≧v≦)o~~')
if score >=90:
    print('厉害了，永远爱你 么么哒！o(∩_∩)o ')
input("按任意键退出ヽ(✿ﾟ▽ﾟ)ノ")













